espruino/Espruino/libs/network/esp32/jswrap_esp32_network.c
/*
 * This file is part of Espruino, a JavaScript interpreter for Microcontrollers
 *
 * Copyright (C) 2015 Gordon Williams <gw@pur3.co.uk>
 *
 * This Source Code Form is subject to the terms of the Mozilla Public
 * License, v. 2.0. If a copy of the MPL was not distributed with this
 * file, You can obtain one at http://mozilla.org/MPL/2.0/.
 *
 * ----------------------------------------------------------------------------
 * This file is designed to be parsed during the build process
 *
 * Contains ESP32 and Wifi library specific functions.
 *
 * FOR DESCRIPTIONS OF THE WIFI FUNCTIONS IN THIS FILE, SEE
 * libs/network/jswrap_wifi.c (or http://www.espruino.com/Reference#Wifi)
 *
 * IMPORTANT: the functions in this file have tests in ./tests/wifi-test-mode.js
 * please maintain these tests if you make functional changes!
 * ----------------------------------------------------------------------------
 */

// Includes from ESP-IDF
#include "esp_wifi.h"
#include "esp_event_loop.h"
#if ESP_IDF_VERSION_MAJOR>=5
#include "esp_netif.h"
#include "esp_event.h"
#include "mdns.h"
#include "ping/ping.h"
#include "esp_ping.h"
#include "esp_sntp.h"
#include "esp_mac.h"
#include "nvs_flash.h"
#elif ESP_IDF_VERSION_MAJOR>=4

#include "tcpip_adapter.h"
#include "mdns.h"
#include "ping/ping.h"
#include "esp_ping.h"
#include "sntp/sntp.h"
#else

#include "tcpip_adapter.h"
#include "mdns/include/mdns.h"
#include "lwip/include/apps/ping/ping.h"
#include "lwip/include/apps/esp_ping.h"
#include "apps/sntp/sntp.h"
#endif

#include "lwip/dns.h"
#include "jsinteractive.h"
#include "network.h"
#include "jswrap_modules.h"
#include "jswrap_esp32_network.h"
#include "jswrap_storage.h"

#include "jsutils.h"

#define UNUSED(x) (void)(x)

#if ESP_IDF_VERSION_MAJOR>=5
esp_netif_t *sta_netif;
static esp_event_handler_instance_t instance_wifi = NULL;
static esp_event_handler_instance_t instance_ip = NULL;
#endif

#ifndef TCPIP_ADAPTER_IF_STA
#define TCPIP_ADAPTER_IF_STA 0
#define TCPIP_ADAPTER_IF_AP  1
#endif

static void sendWifiCompletionCB(
  JsVar **g_jsCallback,  //!< Pointer to the global callback variable
  const char  *reason          //!< NULL if successful, error string otherwise
);

// A callback function to be invoked on a disconnect response.
static JsVar *g_jsDisconnectCallback;

// A callback function to be invoked when we have an IP address.
static JsVar *g_jsGotIpCallback;

// A callback function to be invoked on ping responses.
static JsVar *g_jsPingCallback;

// A callback function to be invoked on gethostbyname responses.
static JsVar *g_jsHostByNameCallback;

// A callback function to be invoked when we complete an access point scan.
static JsVar *g_jsScanCallback;

// A callback function to be invoked when we are being an access point.
static JsVar *g_jsAPStartedCallback;

// The last time we were connected/disconnected as a station.
#if ESP_IDF_VERSION_MAJOR>=5
static wifi_event_sta_connected_t g_lastEventStaConnected;
static wifi_event_sta_disconnected_t g_lastEventStaDisconnected;
#else
static system_event_sta_connected_t g_lastEventStaConnected;
static system_event_sta_disconnected_t g_lastEventStaDisconnected;
#endif

// Are we connected as a station?
static bool g_isStaConnected = false;

// Has the AP started?
static bool g_isAPStarted = false;

/// Number of retries when connecting
static int g_retryCounter = 0;

#define EXPECT_CB_EXCEPTION(jsCB)   jsExceptionHere(JSET_ERROR, "Expecting callback function but got %v", jsCB)
#define EXPECT_OPT_EXCEPTION(jsOPT) jsExceptionHere(JSET_ERROR, "Expecting Object, got %t", jsOPT)

//===== mDNS
static bool mdns_started = 0;

void stopMDNS() {
  jsDebug(DBG_INFO, "Wifi:stopMDNS\n");
  if (mdns_started) {
    mdns_free();
    mdns_started = false;
  }
}

void startMDNS(const char *hostname) {
  jsDebug(DBG_INFO, "Wifi:startMDNS - %s\n", hostname);
  if (mdns_started) stopMDNS();
  esp_err_t err;
  err = mdns_init();
  if (err != ESP_OK) {
    jsDebug(DBG_ERROR, "mDNS init failed: %d\n", err);
    return;
  }
  err = mdns_hostname_set(hostname);
  if (err != ESP_OK) {
    jsDebug(DBG_ERROR, "mDNS hostname_set failed: %d\n", err);
    return;
  }
  err = mdns_service_add(NULL, "_telnet", "_tcp", 23, NULL, 0);
  if (err != ESP_OK) {
    jsDebug(DBG_ERROR, "mDNS service_add failed: %d\n", err);
    return;
  }
  mdns_started = true;
}

/// Convert an wifi_auth_mode_t data type to a string value.
static char *authModeToString(wifi_auth_mode_t authMode) {
  switch(authMode) {
    case WIFI_AUTH_OPEN: return "open";
    case WIFI_AUTH_WEP: return "wep";
    case WIFI_AUTH_WPA_PSK: return "wpa";
    case WIFI_AUTH_WPA2_PSK: return "wpa2";
    case WIFI_AUTH_WPA_WPA2_PSK: return "wpa_wpa2";
    default:  return "unknown";
  }
}

/// Convert an wifi_cipher_type_t data type to a string value.
static char *cipherTypeToString(wifi_cipher_type_t cipherType) {

  switch(cipherType) {
  case WIFI_CIPHER_TYPE_NONE: return "NONE";
  case WIFI_CIPHER_TYPE_WEP40: return "WEP40";
  case WIFI_CIPHER_TYPE_WEP104: return "WEP104";
  case WIFI_CIPHER_TYPE_TKIP: return "TKIP";
  case WIFI_CIPHER_TYPE_CCMP: return "CCMP";
  case WIFI_CIPHER_TYPE_TKIP_CCMP: return "TKIP+CCMP";
  }
  return "unknown";
}

/// Convert an wifi_second_chan_t data type to a string value.
static char *htModeToString(wifi_second_chan_t htMode) {
  switch(htMode) {
    case WIFI_SECOND_CHAN_NONE: return "HT20";
    case WIFI_SECOND_CHAN_ABOVE: return "HT40+";
    case WIFI_SECOND_CHAN_BELOW: return "HT40-";
    default: return "unknown";
  }
}

/// Convert a Wifi reason code to a string representation.
const char *wifiReasonToString(int r) {
  switch (r) {
    case WIFI_REASON_UNSPECIFIED: return "UNSPECIFIED";
    case WIFI_REASON_AUTH_EXPIRE: return "AUTH_EXPIRE";
    case WIFI_REASON_AUTH_LEAVE: return "AUTH_LEAVE";
    case WIFI_REASON_ASSOC_EXPIRE: return "ASSOC_EXPIRE";
    case WIFI_REASON_ASSOC_TOOMANY: return "ASSOC_TOOMANY";
    case WIFI_REASON_NOT_AUTHED: return "NOT_AUTHED";
    case WIFI_REASON_NOT_ASSOCED: return "NOT_ASSOCED";
    case WIFI_REASON_ASSOC_LEAVE: return "ASSOC_LEAVE";
    case WIFI_REASON_ASSOC_NOT_AUTHED: return "ASSOC_NOT_AUTHED";
    case WIFI_REASON_DISASSOC_PWRCAP_BAD: return "DISASSOC_PWRCAP_BAD";
    case WIFI_REASON_DISASSOC_SUPCHAN_BAD: return "DISASSOC_SUPCHAN_BAD";
    case WIFI_REASON_IE_INVALID: return "IE_INVALID";
    case WIFI_REASON_MIC_FAILURE: return "MIC_FAILURE";
    case WIFI_REASON_4WAY_HANDSHAKE_TIMEOUT: return "4WAY_HANDSHAKE_TIMEOUT";
    case WIFI_REASON_GROUP_KEY_UPDATE_TIMEOUT: return "GROUP_KEY_UPDATE_TIMEOUT";
    case WIFI_REASON_IE_IN_4WAY_DIFFERS: return "IE_IN_4WAY_DIFFERS";
    case WIFI_REASON_GROUP_CIPHER_INVALID: return "GROUP_CIPHER_INVALID";
    case WIFI_REASON_PAIRWISE_CIPHER_INVALID: return "PAIRWISE_CIPHER_INVALID";
    case WIFI_REASON_AKMP_INVALID: return "AKMP_INVALID";
    case WIFI_REASON_UNSUPP_RSN_IE_VERSION: return "UNSUPP_RSN_IE_VERSION";
    case WIFI_REASON_INVALID_RSN_IE_CAP: return "INVALID_RSN_IE_CAP";
    case WIFI_REASON_802_1X_AUTH_FAILED: return "802_1X_AUTH_FAILED";
    case WIFI_REASON_CIPHER_SUITE_REJECTED: return "CIPHER_SUITE_REJECTED";
    case WIFI_REASON_BEACON_TIMEOUT: return "BEACON_TIMEOUT";
    case WIFI_REASON_NO_AP_FOUND: return "NO_AP_FOUND";
    case WIFI_REASON_HANDSHAKE_TIMEOUT: return "HANDSHAKE_TIMEOUT";
    case WIFI_REASON_AUTH_FAIL: return "AUTH_FAIL";
    default: return "Unknown reason";
  }
}

/// Convert a wifi_mode_t data type to a string value.
static char *wifiModeToString(wifi_mode_t mode) {
  switch(mode) {
    case WIFI_MODE_NULL: return "NULL";
    case WIFI_MODE_STA: return "STA";
    case WIFI_MODE_AP: return "AP";
    case WIFI_MODE_APSTA: return "APSTA";
    default: return "UNKNOWN";
  }
}

#if ESP_IDF_VERSION_MAJOR>=5
/// Convert an wifi event to a string value.
const char *wifiEventToString(int e) {
  switch (e) {
    case WIFI_EVENT_STA_CONNECTED: return "STA_CONNECTED";
    case WIFI_EVENT_STA_DISCONNECTED: return "STA_DISCONNECTED";
    case WIFI_EVENT_STA_AUTHMODE_CHANGE: return "STA_AUTHMODE_CHANGE";
    case WIFI_EVENT_AP_STACONNECTED: return "AP_STACONNECTED";
    case WIFI_EVENT_AP_STADISCONNECTED: return "AP_STADISCONNECTED";
    case WIFI_EVENT_AP_PROBEREQRECVED: return "AP_PROBEREQRECVED";
    case WIFI_EVENT_WIFI_READY: return "WIFI_READY";
    case WIFI_EVENT_SCAN_DONE: return "SCAN_DONE";
    case WIFI_EVENT_STA_START: return "STA_START";
    case WIFI_EVENT_STA_STOP: return "STA_STOP";
    case WIFI_EVENT_STA_WPS_ER_SUCCESS: return "STA_WPS_ER_SUCCESS";
    case WIFI_EVENT_STA_WPS_ER_FAILED: return "STA_WPS_ER_FAILED";
    case WIFI_EVENT_STA_WPS_ER_TIMEOUT: return "STA_WPS_ER_TIMEOUT";
    case WIFI_EVENT_STA_WPS_ER_PIN: return "STA_WPS_ER_PIN";
    case WIFI_EVENT_AP_START: return "AP_START";
    case WIFI_EVENT_AP_STOP: return "AP_STOP";
    case WIFI_EVENT_MAX: return "MAX";
    case WIFI_REASON_IE_IN_4WAY_DIFFERS: return "IEs in 4-way handshake differ";
    default: return "unknown";
  }
}
#else
/// Convert an wifi event to a string value.
static char *wifiEventToString(uint32_t event){
  switch(event){
    case SYSTEM_EVENT_STA_CONNECTED:return "STA_CONNECTED";
    case SYSTEM_EVENT_STA_DISCONNECTED:return "STA_DISCONNECTED";
    case SYSTEM_EVENT_STA_AUTHMODE_CHANGE:return "STA_AUTHMODE_CHANGE";
    case SYSTEM_EVENT_STA_GOT_IP:return "STA_GOT_IP";
    case SYSTEM_EVENT_AP_STACONNECTED:return "AP_STACONNECTED";
    case SYSTEM_EVENT_AP_STADISCONNECTED: return "AP_STADISCONNECTED";
    case SYSTEM_EVENT_AP_PROBEREQRECVED:return "AP_PROBEREQRECVED";
    case SYSTEM_EVENT_WIFI_READY: return "WIFI_READY";
    case SYSTEM_EVENT_SCAN_DONE: return "SCAN_DONE";
    case SYSTEM_EVENT_STA_START: return "STA_START";
    case SYSTEM_EVENT_STA_STOP: return "STA_STOP";
    case SYSTEM_EVENT_STA_LOST_IP: return "LOST_IP";
    case SYSTEM_EVENT_STA_WPS_ER_SUCCESS: return "STA_WPS_ER_SUCCESS";
    case SYSTEM_EVENT_STA_WPS_ER_FAILED: return "STA_WPS_ER_FAILED";
    case SYSTEM_EVENT_STA_WPS_ER_TIMEOUT: return "STA_WPS_ER_TIMEOUT";
    case SYSTEM_EVENT_STA_WPS_ER_PIN: return "STA_WPS_ER_PIN";
    case SYSTEM_EVENT_AP_START: return "AP_START";
    case SYSTEM_EVENT_AP_STOP: return "AP_STOP";
    case SYSTEM_EVENT_GOT_IP6: return "GOT_IP6";
    case SYSTEM_EVENT_ETH_START: return "ETH_START";
    case SYSTEM_EVENT_ETH_STOP: return "ETH_STOP";
    case SYSTEM_EVENT_ETH_CONNECTED: return "ETH_CONNECTED";
    case SYSTEM_EVENT_ETH_DISCONNECTED: return "ETH_DISCONNECTED";
    case SYSTEM_EVENT_ETH_GOT_IP: return "ETH_GOT_IP";
    case SYSTEM_EVENT_MAX: return "MAX";
#if ESP_IDF_VERSION_MAJOR>=4
    case SYSTEM_EVENT_STA_BEACON_TIMEOUT: return "STA_BEACON_TIMEOUT";
#endif
    default: return "unknown event, see wifiEventToString";
  }
}
#endif

