espruino/Espruino/libs/network/esp32/jswrap_esp32_network.c
/// convert WiFi error to a string value.
static char *wifiErrorToString(esp_err_t err){
  jsDebug(DBG_INFO, "wifiErrorToString %d: %s \n", err,esp_err_to_name(err));
  return (char *) esp_err_to_name(err);
}

/// Callback function that is invoked at the culmination of a scan.
static void event_handler_scan_done() {
  /**
   * Create a JsVar that is an array of JS objects where each JS object represents a
   * retrieved access point set of information.   The structure of a record will be:
   * o authMode
   * o isHidden
   * o rssi
   * o channel
   * o ssid
   * When the array has been built, invoke the callback function passing in the array
   * of records.
   */
  if (g_jsScanCallback == NULL)
    return;
  uint16_t apCount;
  ESP_ERROR_CHECK(esp_wifi_scan_get_ap_num(&apCount));
  JsVar *jsAccessPointArray = jsvNewArray(NULL, 0);
  if (apCount > 0) {
    wifi_ap_record_t *list = (wifi_ap_record_t *)malloc(sizeof(wifi_ap_record_t) * apCount);
    ESP_ERROR_CHECK(esp_wifi_scan_get_ap_records(&apCount, list));
    int i;
    for (i=0; i<apCount; i++) {
      JsVar *jsCurrentAccessPoint = jsvNewObject();
      jsvObjectSetIntChild(jsCurrentAccessPoint, "rssi", list[i].rssi);
      jsvObjectSetStringChild(jsCurrentAccessPoint, "authMode", authModeToString(list[i].authmode));

      // The SSID may **NOT** be NULL terminated ... so handle that.
      char temp[32 + 1];
      strncpy((char *)temp, list[i].ssid, 32);
      temp[32] = '\0';
      jsvObjectSetStringChild(jsCurrentAccessPoint, "ssid", temp);
      sprintf(temp, MACSTR, MAC2STR(list[i].bssid));
      jsvObjectSetStringChild(jsCurrentAccessPoint, "mac", temp);
      sprintf(temp, "%d", list[i].primary);
      jsvObjectSetStringChild(jsCurrentAccessPoint, "channel", temp);
      // Can't find a flag for this?  http://esp-idf.readthedocs.io/en/latest/api-reference/wifi/esp_wifi.html?highlight=wifi_ap_record_t
      //jsvObjectSetBoolChild(jsCurrentAccessPoint, "isHidden", list[i].ssid_hidden);
      // Add the new record to the array
      jsvArrayPush(jsAccessPointArray, jsCurrentAccessPoint);
      jsvUnLock(jsCurrentAccessPoint);
    }
    free(list);
  } // Number of access points > 0

  // We have now completed the scan callback, so now we can invoke the JS callback.
  JsVar *params[1] = { jsAccessPointArray };
  jsiQueueEvents(NULL, g_jsScanCallback, params, 1);

  jsvUnLock(jsAccessPointArray);
  jsvUnLock(g_jsScanCallback);
  g_jsScanCallback = NULL;
}


/** Get the global object for the Wifi library/module, this is used in order to send the
 * "on event" callbacks to the handlers.
 */
static JsVar *getWifiModule() {
  JsVar *moduleName = jsvNewFromString("Wifi");
  JsVar *m = jswrap_require(moduleName);
  jsvUnLock(moduleName);
  return m;
}

/**
 * Invoke the JavaScript callback to notify the program that an ESP8266
 * WiFi event has occurred.
 */
static void sendWifiEvent(
    const char *eventName, //!< The ESP32 WiFi event type.
    JsVar *jsDetails  //!< The JS object to be passed as a parameter to the callback.
) {
  JsVar *module = getWifiModule();
  if (!module) {
    return; // out of memory?
  }

  // get event name as string and compose param list
  JsVar *params[1];
  params[0] = jsDetails;
  jsDebug(DBG_INFO, "sendWifiEvent %s\n", eventName);
  jsiQueueObjectCallbacks(module, eventName, params, 1);
  jsvUnLock(module);
  return;
}

/** Called when we can an AP or Station disconnect event. If
 * we don't seem to be connected to anything, stop wifi*/
void stopWifiIfIdle() {
  wifi_mode_t mode;
  esp_wifi_get_mode(&mode);
  if ((mode == WIFI_MODE_NULL ||
      (mode == WIFI_MODE_STA && !g_isStaConnected)) &&
      !g_jsScanCallback/*scanning*/) {
    jsDebug(DBG_INFO, "stopWifiIfIdle: calling esp_wifi_stop()\n");
    esp_wifi_stop();
  }
}

/**
 * Wifi event handler
 * Here we get invoked whenever a WiFi event is received from the ESP32 WiFi subsystem. */
#if ESP_IDF_VERSION_MAJOR>=5
static void wifi_event_handler(void* arg, esp_event_base_t event_base, int32_t event_id, void* event_data) {
#else
static esp_err_t event_handler(void *ctx, system_event_t *event) {
  UNUSED(ctx);
#endif
#if ESP_IDF_VERSION_MAJOR>=5
  jsDebug(DBG_INFO, "Event: %s (%d)\n", event_base == WIFI_EVENT ? wifiEventToString(event_id) : "OTHER", event_id);
#else
  jsDebug(DBG_INFO, "Wifi: Event(%d):SYSTEM_EVENT_%s\n", event->event_id, wifiEventToString(event->event_id));
#endif
#if ESP_IDF_VERSION_MAJOR>=5
  if (event_base == WIFI_EVENT && event_id >= WIFI_EVENT_MAX) {
    jsDebug(DBG_INFO, "Internal event ");
  }
#endif
#if ESP_IDF_VERSION_MAJOR>=5
  if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_DISCONNECTED) {
    wifi_event_sta_disconnected_t *disconnected = (wifi_event_sta_disconnected_t*)event_data;
#else
  if (event->event_id == SYSTEM_EVENT_STA_DISCONNECTED) {
    system_event_sta_disconnected_t *disconnected = &event->event_info.disconnected;
#endif
    if (--g_retryCounter > 0 ) {
      esp_wifi_connect();
      jsDebug(DBG_INFO, "retry to AP connect\n");
    } else {
      g_isStaConnected = false; // Flag as disconnected
      g_lastEventStaDisconnected = *disconnected; // Save the last disconnected info
      if (jsvIsFunction(g_jsDisconnectCallback)) {
        jsiQueueEvents(NULL, g_jsDisconnectCallback, NULL, 0);
        jsvUnLock(g_jsDisconnectCallback);
        g_jsDisconnectCallback = NULL;
      }
      JsVar *jsDetails = jsvNewObject();

      char temp[33];
      memcpy(temp, disconnected->ssid, 32);
      temp[32] = '\0';
      jsvObjectSetStringChild(jsDetails, "ssid", temp);
      sprintf(temp, MACSTR, MAC2STR(disconnected->bssid));
      jsvObjectSetStringChild(jsDetails, "mac", temp);
      sprintf(temp, "%d",disconnected->reason);
      jsvObjectSetStringChild(jsDetails, "reason", temp);
      jsvObjectSetStringChild(jsDetails, "msg", wifiReasonToString(disconnected->reason));
      sendWifiEvent("#ondisconnected", jsDetails);
      if (g_jsGotIpCallback) {
        /* If we were connecting, g_jsGotIpCallback is set. If we fail (eg this event is fired) then we
        should call the callback with the first argument as the error */
        sendWifiCompletionCB(&g_jsGotIpCallback, wifiReasonToString(disconnected->reason));
      }
      stopWifiIfIdle();
    }
  } else
#if ESP_IDF_VERSION_MAJOR>=5
  if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_CONNECTED) {
    wifi_event_sta_connected_t* connected = (wifi_event_sta_connected_t*)event_data;
#else
  if (event->event_id == SYSTEM_EVENT_STA_CONNECTED) {
    system_event_sta_connected_t *connected = &event->event_info.connected;
#endif
    g_isStaConnected = true; // Flag us as connected.
    g_lastEventStaConnected = *connected; // Save the last connected info
    // Publish the on("associated") event to any one who has registered an interest.
    JsVar *jsDetails = jsvNewObject();
    char temp[33];
    memcpy(temp, connected->ssid, 32);
    temp[32] = '\0';
    jsvObjectSetStringChild(jsDetails, "ssid", temp);
    sprintf(temp, MACSTR, MAC2STR(connected->bssid));
    jsvObjectSetStringChild(jsDetails, "mac", temp);
    sprintf(temp, "%d", connected->channel);
    jsvObjectSetStringChild(jsDetails, "channel", temp);
    sendWifiEvent("#onassociated", jsDetails);
  } else
#if ESP_IDF_VERSION_MAJOR>=5
  if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START) {
#else
  if (event->event_id == SYSTEM_EVENT_STA_START) {
#endif
    // Wifi has started, perform an esp_wifi_connect
    esp_err_t err = esp_wifi_connect();
    if (err != ESP_OK)
      jsDebug(DBG_INFO, "Wifi: event_handler STA_START: esp_wifi_connect: %d(%s)\n", err,wifiErrorToString(err));
  } else
#if ESP_IDF_VERSION_MAJOR>=5
  if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP) {
    ip_event_got_ip_t* ipevent = (ip_event_got_ip_t*)event_data;
#else
  if (event->event_id == SYSTEM_EVENT_STA_GOT_IP) {
    system_event_sta_got_ip_t *ipevent = &event->event_info.got_ip;
#endif
    sendWifiCompletionCB(&g_jsGotIpCallback, NULL);
    JsVar *jsDetails = jsvNewObject();
    char temp[16]; // max: "xxx.xxx.xxx.xxx\0"
    sprintf(temp, IPSTR, IP2STR(&ipevent->ip_info.ip));
    jsvObjectSetStringChild(jsDetails, "ip", temp);
    sprintf(temp, IPSTR, IP2STR(&ipevent->ip_info.netmask));
    jsvObjectSetStringChild(jsDetails, "netmask", temp);
    sprintf(temp, IPSTR, IP2STR(&ipevent->ip_info.gw));
    jsvObjectSetStringChild(jsDetails, "gw", temp);
    jsDebug(DBG_INFO, "Wifi: About to emit connect!\n");
    sendWifiEvent("#onconnected", jsDetails);
    // start mDNS
    const char * hostname;
#if ESP_IDF_VERSION_MAJOR>=5
    esp_err_t err = esp_netif_get_hostname(sta_netif, &hostname);
#else
    esp_err_t err = tcpip_adapter_get_hostname(TCPIP_ADAPTER_IF_STA, &hostname);
#endif
    if (hostname && hostname[0] != 0) {
      startMDNS(hostname);
    }
  } else
#if ESP_IDF_VERSION_MAJOR>=5
  if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_AP_STACONNECTED) {
    wifi_event_ap_staconnected_t* sta_connected = (wifi_event_ap_staconnected_t*)event_data;
#else
  if (event->event_id == SYSTEM_EVENT_AP_STACONNECTED) {
    system_event_ap_staconnected_t *sta_connected = &event->event_info.sta_connected;
#endif
    JsVar *jsDetails = jsvNewObject();
    char temp[18]; // "xx:xx:xx:xx:xx:xx\0"
    sprintf(temp, MACSTR, MAC2STR(sta_connected->mac));
    jsvObjectSetStringChild(jsDetails, "mac", temp);
    sendWifiEvent("#onsta_joined", jsDetails);
  } else
#if ESP_IDF_VERSION_MAJOR>=5
  if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_AP_STADISCONNECTED) {
    wifi_event_ap_stadisconnected_t* sta_disconnected = (wifi_event_ap_stadisconnected_t*)event_data;
#else
  if (event->event_id == SYSTEM_EVENT_AP_STADISCONNECTED) {
    system_event_ap_stadisconnected_t *sta_disconnected = &event->event_info.sta_disconnected;
#endif
    JsVar *jsDetails = jsvNewObject();
    char temp[18]; // "xx:xx:xx:xx:xx:xx\0"
    sprintf(temp, MACSTR, MAC2STR(sta_disconnected->mac));
    jsvObjectSetStringChild(jsDetails, "mac", temp);
    sendWifiEvent("#onsta_left", jsDetails);
  } else
#if ESP_IDF_VERSION_MAJOR>=5
  if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_SCAN_DONE) {
#else
  if (event->event_id == SYSTEM_EVENT_SCAN_DONE) {
#endif
    /* Called when a previous network scan has completed.  Here we check to see if we have
      a registered callback that is interested in being called when a scan has completed
      and, if we do, we build the parameters for that callback and then invoke it.  */
    event_handler_scan_done();
    stopWifiIfIdle();
  } else
#if ESP_IDF_VERSION_MAJOR>=5
  if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_AP_START) {
#else
  if (event->event_id == SYSTEM_EVENT_AP_START) {
#endif
    // Called when we have started being an access point.
    g_isAPStarted = true;
    sendWifiCompletionCB(&g_jsAPStartedCallback, NULL);
  } else
#if ESP_IDF_VERSION_MAJOR>=5
  if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_AP_STOP) {
#else
  if (event->event_id == SYSTEM_EVENT_AP_STOP) {
#endif
    // Called when we have stopped being an access point.
    g_isAPStarted = false;
    stopWifiIfIdle();
  } else
#if ESP_IDF_VERSION_MAJOR>=5
    jsDebug(DBG_INFO, "Wifi: event_handler -> NOT HANDLED EVENT: %d\n", event_id );
#else
    jsDebug(DBG_INFO, "Wifi: event_handler -> NOT HANDLED EVENT: %d\n", event->event_id );
#endif
#if ESP_IDF_VERSION_MAJOR<5
  return ESP_OK;
#endif
}

/**
 * Initialize the one time ESP32 wifi components including the event
 * handler.
 */
void esp32_wifi_init() {
#if ESP_IDF_VERSION_MAJOR>=5
  ESP_ERROR_CHECK(esp_netif_init());
  ESP_ERROR_CHECK(esp_event_loop_create_default());
  esp_netif_create_default_wifi_ap();
  esp_netif_create_default_wifi_sta();
#else
  tcpip_adapter_init();
  ESP_ERROR_CHECK( esp_event_loop_init(event_handler, NULL));
#endif

