espruino/Espruino/libs/network/esp32/jswrap_esp32_network.c
  // Get the current mode of operation.
  wifi_mode_t mode;
  esp_wifi_get_mode(&mode);

  // Get the current power save type
  wifi_ps_type_t psType;
  esp_wifi_get_ps(&psType);
  char *psTypeStr;
  switch(psType) {
#if ESP_IDF_VERSION_MAJOR>=4
  case WIFI_PS_MIN_MODEM:
    psTypeStr = "min_modem";
    break;
  case WIFI_PS_MAX_MODEM:
    psTypeStr = "max_modem";
    break;
#else
  case WIFI_PS_MODEM:
    psTypeStr = "modem";
    break;
#endif
  case WIFI_PS_NONE:
    psTypeStr = "none";
    break;
  default:
    psTypeStr = "unknown";
    break;
  }

  JsVar *jsWiFiStatus = jsvNewObject();
  if (g_isStaConnected) {
    jsvObjectSetStringChild(jsWiFiStatus, "station", "connected");

    if (mode == WIFI_MODE_STA || mode == WIFI_MODE_APSTA) {
      wifi_ap_record_t ap_info;
      esp_wifi_sta_get_ap_info(&ap_info);
      char buf[35];

      // SSID of AP
      strncpy(buf, ap_info.ssid, sizeof(buf));
      buf[34] = 0;
      jsvObjectSetStringChild(jsWiFiStatus, "ssid", buf);

      // MAC address of AP
      sprintf(buf, MACSTR, MAC2STR(ap_info.bssid));
      buf[18] = 0;
      jsvObjectSetStringChild(jsWiFiStatus, "bssid", buf);

      // Channel of AP
      jsvObjectSetIntChild(jsWiFiStatus, "channel", ap_info.primary);

      // RSSI
      jsvObjectSetIntChild(jsWiFiStatus, "rssi", ap_info.rssi);

      // HT mode
      jsvObjectSetChildAndUnLock(jsWiFiStatus, "htMode",
        jsvNewFromString(htModeToString(ap_info.second)));

      // Auth mode
      jsvObjectSetChildAndUnLock(jsWiFiStatus, "authMode",
        jsvNewFromString(authModeToString(g_lastEventStaConnected.authmode)));

      /* Later version
       * // Pairwise cipher
       * jsvObjectSetChildAndUnLock(jsWiFiStatus, "pairwiseCipher",
       *   jsvNewFromString(cipherTypeToString(ap_info.pairwise_cipher)));
       *
       * // Group cipher
       * jsvObjectSetChildAndUnLock(jsWiFiStatus, "groupCipher",
       *   jsvNewFromString(cipherTypeToString(ap_info.group_cipher)));
       */
    }

  } else {
    jsvObjectSetChildAndUnLock(jsWiFiStatus, "station",
        jsvNewFromString(wifiReasonToString(g_lastEventStaDisconnected.reason)));
  }
  // if wifi hasn't started, return NULL
  if (!g_isAPStarted && !g_isStaConnected)
    mode = WIFI_MODE_NULL;
  jsvObjectSetStringChild(jsWiFiStatus, "mode", wifiModeToString(mode));
  jsvObjectSetStringChild(jsWiFiStatus, "powersave", psTypeStr);

  return jsWiFiStatus;
}


void jswrap_wifi_setConfig(JsVar *jsSettings) {
  // Make sure jsSetings an object
  if (!jsvIsObject(jsSettings)) {
    EXPECT_OPT_EXCEPTION(jsSettings);
    return;
  }

  // phy setting
  JsVar *jsPhy = jsvObjectGetChildIfExists(jsSettings, "phy");
  if (jsvIsString(jsPhy)) {
    if (jsvIsStringEqual(jsPhy, "11b")) {
      esp_wifi_set_protocol(WIFI_IF_AP,WIFI_PROTOCOL_11B);
    } else if (jsvIsStringEqual(jsPhy, "11g")) {
      esp_wifi_set_protocol(WIFI_IF_AP,WIFI_PROTOCOL_11B| WIFI_PROTOCOL_11G);
    } else if (jsvIsStringEqual(jsPhy, "11n")) {
      esp_wifi_set_protocol(WIFI_IF_AP,WIFI_PROTOCOL_11B| WIFI_PROTOCOL_11G|WIFI_PROTOCOL_11N);
    } else {
      jsvUnLock(jsPhy);
      jsExceptionHere(JSET_ERROR, "Unknown phy mode");
      return;
    }
  }
  if (jsPhy != NULL) jsvUnLock(jsPhy);

  // powersave setting
  // Call esp_wifi_set_ps(WIFI_PS_MIN_MODEM) to enable Modem-sleep minimum power save mode or esp_wifi_set_ps(WIFI_PS_MAX_MODEM)
  JsVar *jsPowerSave = jsvObjectGetChildIfExists(jsSettings, "powersave");
  if (jsvIsString(jsPowerSave)) {
    if (jsvIsStringEqual(jsPowerSave, "none")) {
      esp_wifi_set_ps(WIFI_PS_NONE);
#if !(ESP_IDF_VERSION_MAJOR>=4)
    } else if (jsvIsStringEqual(jsPowerSave, "ps-poll")) {
      esp_wifi_set_ps(WIFI_PS_MODEM);
#endif
    } else if (jsvIsStringEqual(jsPowerSave, "min")) {
      esp_wifi_set_ps(WIFI_PS_MIN_MODEM);
    } else if (jsvIsStringEqual(jsPowerSave, "max")) {
      esp_wifi_set_ps(WIFI_PS_MAX_MODEM);
    } else {
      jsvUnLock(jsPowerSave);
      jsExceptionHere(JSET_ERROR, "Unknown powersave mode");
      return;
    }
  }
  if (jsPowerSave != NULL) jsvUnLock(jsPowerSave);
}

JsVar *jswrap_wifi_getDetails(JsVar *jsCallback) {
  // Check callback
  if (jsCallback != NULL && !jsvIsNull(jsCallback) && !jsvIsFunction(jsCallback)) {
    EXPECT_CB_EXCEPTION(jsCallback);
    return NULL;
  }

  JsVar *jsDetails = jsvNewObject();
  if (g_isStaConnected == true) {
    wifi_sta_config_t config;
    esp_wifi_get_config(WIFI_IF_STA, (wifi_config_t *)&config);
    char buf[65];

    // ssid
    strncpy(buf, (char *)config.ssid, 32);
    buf[32] = 0;
    jsvObjectSetStringChild(jsDetails, "ssid", buf);

    // password
    strncpy(buf, (char *)config.password, 64);
    buf[64] = 0;
    jsvObjectSetStringChild(jsDetails, "password", (char *)config.password);

    // Status
    jsvObjectSetStringChild(jsDetails, "status", "connected");

    // Authmode
    jsvObjectSetChildAndUnLock(jsDetails, "authMode",
        jsvNewFromString(authModeToString(g_lastEventStaConnected.authmode)));
  } else {
    // Status
    jsvObjectSetChildAndUnLock(jsDetails, "status",
        jsvNewFromString(wifiReasonToString(g_lastEventStaDisconnected.reason)));
  }

  // Schedule callback if a function was provided
  if (jsvIsFunction(jsCallback)) {
    JsVar *params[1];
    params[0] = jsDetails;
    jsiQueueEvents(NULL, jsCallback, params, 1);
  }
  return jsDetails;
}


JsVar *jswrap_wifi_getAPDetails(JsVar *jsCallback) {
  // Check callback
  if (jsCallback != NULL && !jsvIsNull(jsCallback) && !jsvIsFunction(jsCallback)) {
    EXPECT_CB_EXCEPTION(jsCallback);
    return NULL;
  }

  JsVar *jsDetails = jsvNewObject();

  wifi_ap_config_t config;
  esp_wifi_get_config(WIFI_IF_AP, (wifi_config_t *)&config);
  jsvObjectSetStringChild(jsDetails, "authMode", authModeToString(config.authmode));
  jsvObjectSetBoolChild(jsDetails, "hidden", config.ssid_hidden);
  jsvObjectSetIntChild(jsDetails, "maxConn", config.max_connection);

  char buf[65];

  // ssid
  strncpy(buf, (char *)config.ssid, 32);
  buf[32] = 0;
  jsvObjectSetStringChild(jsDetails, "ssid", buf);

  // password
  strncpy(buf, (char *)config.password, 64);
  buf[64] = 0;
  jsvObjectSetStringChild(jsDetails, "password", (char *)config.password);

  // Schedule callback if a function was provided
  if (jsvIsFunction(jsCallback)) {
    JsVar *params[1];
    params[0] = jsDetails;
    jsiQueueEvents(NULL, jsCallback, params, 1);
  }
  return jsDetails;
}

void jswrap_wifi_save(JsVar *what) {
  jsDebug(DBG_INFO, "Wifi.save\n");
  JsVar *o = jsvNewObject();
  if (!o) return;

