espruino/Espruino/libs/network/esp32/jswrap_esp32_network.c
  if (jsvIsString(what) && jsvIsStringEqual(what, "clear")) {
    JsVar *name = jsvNewFromString(WIFI_CONFIG_STORAGE_NAME);
    jswrap_storage_erase(name);
    jsvUnLock(name);
    jsDebug(DBG_INFO, "Wifi.save(clear)\n");
    return;
  }

  // station stuff
  wifi_sta_config_t sta_config;
  esp_wifi_get_config(WIFI_IF_STA, (wifi_config_t *)&sta_config);
  jsvObjectSetStringChild(o, "ssid", (char *)sta_config.ssid);
  jsvObjectSetStringChild(o, "password", (char *)sta_config.password);

  wifi_mode_t wifi_mode;
  esp_wifi_get_mode(&wifi_mode);
  jsvObjectSetIntChild(o, "mode", wifi_mode);

  //jsvObjectSetIntChild(o, "phyMode", wifi_get_phy_mode());
  wifi_ps_type_t psType;
  esp_wifi_get_ps(&psType);
  jsvObjectSetIntChild(o, "sleepType", psType);

  wifi_ap_config_t ap_config;
  esp_wifi_get_config(WIFI_IF_AP, (wifi_config_t *)&ap_config);

  jsvObjectSetStringChild(o, "ssidAP", (char *)ap_config.ssid);
  jsvObjectSetStringChild(o, "passwordAP", (char *) ap_config.password);
  jsvObjectSetIntChild(o, "authmodeAP", ap_config.authmode);
  jsvObjectSetIntChild(o, "hiddenAP", ap_config.ssid_hidden);
  jsvObjectSetIntChild(o, "channelAP", ap_config.channel);

  const char * hostname = NULL;
#if ESP_IDF_VERSION_MAJOR>=5
  esp_netif_t *netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
  esp_err_t err = esp_netif_get_hostname(netif, &hostname);
  jsDebug(DBG_INFO,"esp_netif_get_hostname: %s\n", wifiErrorToString(err));
  jsDebug(DBG_INFO,"hostname: %s\n", hostname);
#else
  esp_err_t err = tcpip_adapter_get_hostname(TCPIP_ADAPTER_IF_STA, &hostname);
#endif
  if (hostname) jsvObjectSetStringChild(o, "hostname", (char *) hostname);

  // save object
  JsVar *name = jsvNewFromString(WIFI_CONFIG_STORAGE_NAME);
  jswrap_storage_erase(name);
  jswrap_storage_write(name,o,0,0);
  jsvUnLock2(name,o);

  jsDebug(DBG_INFO, "Wifi.save: write completed\n");
}

void jswrap_wifi_restore(void) {
  jsDebug(DBG_INFO, "jswrap_wifi_restore\n");

#if CONFIG_IDF_TARGET_ESP32C3
  esp_wifi_set_max_tx_power(34); // 8.5dBm
#endif

  JsVar *name = jsvNewFromString(WIFI_CONFIG_STORAGE_NAME);
  JsVar *o = jswrap_storage_readJSON(name, true);
  if (!o) { // no data
    jsDebug(DBG_INFO, "jswrap_wifi_restore: No data - not starting WiFi\n");
    jsvUnLock2(name,o);
    return;
  }

  JsVar *v;
  wifi_mode_t savedMode = jsvObjectGetIntegerChild(o,"mode");
  esp_wifi_set_mode(savedMode);

  wifi_config_t config;  // Unified config for IDF 5.x
  bzero(&config, sizeof(config));

  esp_err_t err;
  if (savedMode & WIFI_MODE_AP) {
    config.ap.authmode = jsvObjectGetIntegerChild(o,"authmodeAP");
    config.ap.ssid_hidden = jsvObjectGetIntegerChild(o,"hiddenAP");

    v = jsvObjectGetChildIfExists(o,"ssidAP");
    config.ap.ssid_len = jsvGetString(v, (char *)config.ap.ssid, sizeof(config.ap.ssid));
    jsvUnLock(v);

    v = jsvObjectGetChildIfExists(o,"passwordAP");
    jsvGetString(v, (char *)config.ap.password, sizeof(config.ap.password));
    jsvUnLock(v);

    config.ap.channel = jsvObjectGetIntegerChild(o,"channelAP");

    config.ap.max_connection = 4;
    config.ap.beacon_interval = 100;
    err = esp_wifi_set_config(WIFI_IF_AP, &config);  // Fixed: apConfig -> config
    jsDebug(DBG_INFO, "jswrap_wifi_restore: AP=%s\n", config.ap.ssid);
  }

  if (savedMode & WIFI_MODE_STA) {
    v = jsvObjectGetChildIfExists(o,"ssid");
    jsvGetString(v, (char *)config.sta.ssid, sizeof(config.sta.ssid));
    jsvUnLock(v);

    v = jsvObjectGetChildIfExists(o,"password");
    jsvGetString(v, (char *)config.sta.password, sizeof(config.sta.password));
    jsvUnLock(v);

    err = esp_wifi_set_config(ESP_IF_WIFI_STA, &config);  // Fixed ESP_IF_WIFI_STA
    jsDebug(DBG_INFO, "Wifi.restore: STA=%s\n", config.sta.ssid);
  }

  err = esp_wifi_start();
  if (err != ESP_OK) {
    jsError("jswrap_wifi_restore: esp_wifi_start: %d(%s)", err - ESP_ERR_WIFI_BASE, wifiErrorToString(err));
    jsvUnLock2(name,o);
    return;
  }

  if (savedMode & WIFI_MODE_STA) {
    v = jsvObjectGetChildIfExists(o,"hostname");
    if (v) {
      char hostname[64];
      jsvGetString(v, hostname, sizeof(hostname));
      jsDebug(DBG_INFO, "Wifi.restore: hostname=%s\n", hostname);
#if ESP_IDF_VERSION_MAJOR >= 5
      esp_netif_t *netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
      if (netif) esp_netif_set_hostname(netif, hostname);
#else
      tcpip_adapter_set_hostname(TCPIP_ADAPTER_IF_STA, hostname);
#endif
    }
    jsvUnLock(v);
  }

  if ((savedMode == WIFI_MODE_STA) || (savedMode == WIFI_MODE_APSTA)) {
    err = esp_wifi_connect();
    if (err != ESP_OK) {
      jsError("jswrap_wifi_restore: esp_wifi_connect: %d(%s)", err - ESP_ERR_WIFI_BASE, wifiErrorToString(err));
      jsvUnLock2(name,o);
      return;
    }
  } else {
    jsDebug(DBG_INFO, "Wifi: Both STA AND APSTA are off\n");
  }

  jsvUnLock2(name,o);
}

/**
 * Get the ip info for the given interface.  The interfaces are:
 * * TCPIP_ADAPTER_IF_STA - Station
 * * TCPIP_ADAPTER_IF_AP - Access Point
 */
static JsVar *getIPInfo(JsVar *jsCallback, int interface) {
  if (jsCallback && !jsvIsNull(jsCallback) && !jsvIsFunction(jsCallback)) {
    EXPECT_CB_EXCEPTION(jsCallback);
    return NULL;
  }

  JsVar *jsIpInfo = jsvNewObject();
  if (!jsIpInfo) return NULL;  // Early out on OOM

#if ESP_IDF_VERSION_MAJOR >= 5
  esp_netif_t *netif = esp_netif_get_handle_from_ifkey(
    interface == TCPIP_ADAPTER_IF_STA ? "WIFI_STA_DEF" : "WIFI_AP_DEF"
  );
  esp_netif_ip_info_t ipInfo;
  esp_err_t err = (netif) ? esp_netif_get_ip_info(netif, &ipInfo) : ESP_FAIL;
#else
  tcpip_adapter_ip_info_t ipInfo;
  esp_err_t err = tcpip_adapter_get_ip_info(interface, &ipInfo);
#endif

  if (err == ESP_OK) {
    jsvObjectSetChildAndUnLock(jsIpInfo, "ip",
      networkGetAddressAsString((uint8_t*)&ipInfo.ip, 4, 10, '.'));
    jsvObjectSetChildAndUnLock(jsIpInfo, "netmask",
      networkGetAddressAsString((uint8_t*)&ipInfo.netmask, 4, 10, '.'));
    jsvObjectSetChildAndUnLock(jsIpInfo, "gw",
      networkGetAddressAsString((uint8_t*)&ipInfo.gw, 4, 10, '.'));
  }

  // MAC always succeeds
  uint8_t mac[6];
  wifi_interface_t wifif = interface == TCPIP_ADAPTER_IF_STA ? WIFI_IF_STA : WIFI_IF_AP;
  esp_wifi_get_mac(wifif, mac);
  char macStr[18];
  sprintf(macStr, MACSTR, MAC2STR(mac));
  jsvObjectSetStringChild(jsIpInfo, "mac", macStr);

  // Callback
  if (jsvIsFunction(jsCallback)) {
    JsVar *params[2] = {jsvNewWithFlags(JSV_NULL), jsIpInfo};
    jsiQueueEvents(NULL, jsCallback, params, 2);
    jsvUnLock(params[0]);
  }

  return jsIpInfo;

