espruino/Espruino/libs/network/esp32/jswrap_esp32_network.c
}

JsVar *jswrap_wifi_getIP(JsVar *jsCallback) {
  JsVar *jsIpInfo = getIPInfo(jsCallback, TCPIP_ADAPTER_IF_STA);
  return jsIpInfo;
}

JsVar *jswrap_wifi_getAPIP(JsVar *jsCallback) {
  JsVar *jsIpInfo = getIPInfo(jsCallback, TCPIP_ADAPTER_IF_AP);
  return jsIpInfo;
}

JsVar *jswrap_wifi_getHostname(JsVar *jsCallback) {
  const char *hostname = NULL;
#if ESP_IDF_VERSION_MAJOR >= 5
  esp_netif_t *netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");

  if (netif != NULL) {
    esp_err_t err = esp_netif_get_hostname(netif, &hostname);
    if (err != ESP_OK || hostname == NULL) {
      hostname = "";
    }
  } else {
    hostname = "";
  }
#else
  esp_err_t err = tcpip_adapter_get_hostname(TCPIP_ADAPTER_IF_STA, &hostname);
  if (err != ESP_OK || hostname == NULL) {
    hostname = "";
  }
#endif
  return jsvNewFromString(hostname ? hostname : "");
}

void jswrap_wifi_setHostname(JsVar *jsHostname, JsVar *jsCallback) {
  char hostname[256];
  jsvGetString(jsHostname, hostname, sizeof(hostname));
  jsDebug(DBG_INFO, "Wifi.setHostname: %s\n", hostname);

#if ESP_IDF_VERSION_MAJOR >= 5
  esp_netif_t *netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
  if (netif != NULL) {
    esp_err_t err = esp_netif_set_hostname(netif, hostname);
    if (err != ESP_OK) {
      jsExceptionHere(JSET_ERROR, "Failed to set hostname");
    }
  }
#else
  esp_err_t err = tcpip_adapter_set_hostname(TCPIP_ADAPTER_IF_STA, hostname);
  if (err != ESP_OK) {
    jsExceptionHere(JSET_ERROR, "Failed to set hostname");
  }
#endif

  // now update mDNS
  startMDNS(hostname);

  if (jsvIsFunction(jsCallback)) {
    jsiQueueEvents(0, jsCallback, 0, 0);
  }
}

static uint8_t seq_no;

esp_err_t pingResults(ping_target_id_t msgType, esp_ping_found * pingResp){
	//printf("AvgTime:%.1fmS Sent:%d Rec:%d Err:%d min(mS):%d max(mS):%d ",
  //(float)pf->total_time/pf->recv_count, pf->send_count, pf->recv_count, pf->err_count, pf->min_time, pf->max_time );
	//printf("Resp(mS):%d Timeouts:%d Total Time:%d\n",pf->resp_time, pf->timeout_count, pf->total_time);
  if (g_jsPingCallback != NULL) {
    JsVar *jsPingResponse = jsvNewObject();
    jsvObjectSetIntChild(jsPingResponse, "totalCount", pingResp->send_count);
    jsvObjectSetIntChild(jsPingResponse, "totalBytes", pingResp->total_bytes);
    jsvObjectSetIntChild(jsPingResponse, "totalTime", pingResp->total_time);
    jsvObjectSetIntChild(jsPingResponse, "respTime", pingResp->resp_time);
    // don't have a sequence
    jsvObjectSetIntChild(jsPingResponse, "seqNo", ++seq_no);
    jsvObjectSetIntChild(jsPingResponse, "timeoutCount", pingResp->timeout_count);
    jsvObjectSetIntChild(jsPingResponse, "bytes", pingResp->bytes);
    jsvObjectSetIntChild(jsPingResponse, "error", pingResp->err_count);
    JsVar *params[1];
    params[0] = jsPingResponse;
    jsiQueueEvents(NULL, g_jsPingCallback, params, 1);
    jsvUnLock(jsPingResponse);
  }
	return ESP_OK;
}

void jswrap_wifi_ping(
    JsVar *ipAddr,      //!< A string or integer representation of an IP address.
    JsVar *pingCallback //!< Optional callback function.
) {
  // If the parameter is a string, get the IP address from the string
  // representation.
  ip4_addr_t ip;
  if (jsvIsString(ipAddr)) {
    char ipString[20];
    jsvGetString(ipAddr, ipString, sizeof(ipString)-1);
    ip.addr = networkParseIPAddress(ipString);
    if (ip.addr == 0) {
        jsExceptionHere(JSET_ERROR, "Not a valid IP address");
      return;
    }
  } else
  // If the parameter is an integer, treat it as an IP address.
  if (jsvIsInt(ipAddr)) {
    ip.addr = jsvGetInteger(ipAddr);
  } else
  // The parameter was neither a string nor an IP address and hence we don't
  // know how to get the IP address of the partner to ping so throw an
  // exception.
  {
      jsExceptionHere(JSET_ERROR, "IP address must be string or integer");
    return;
  }

  if (jsvIsUndefined(pingCallback) || jsvIsNull(pingCallback)) {
    if (g_jsPingCallback != NULL) {
      jsvUnLock(g_jsPingCallback);
    }
    g_jsPingCallback = NULL;
  } else if (!jsvIsFunction(pingCallback)) {
      jsExceptionHere(JSET_ERROR, "Callback is not a function");
    return;
  } else {
    if (g_jsPingCallback != NULL) {
      jsvUnLock(g_jsPingCallback);
    }
    g_jsPingCallback = pingCallback;
    jsvLockAgainSafe(g_jsPingCallback);
  }

  // We now have an IP address to ping ... so ping.

  uint32_t ping_count = 5;  //how many pings per report
  uint32_t ping_timeout = 1000; //mS till we consider it timed out
  uint32_t ping_delay = 500; //mS between pings
  esp_ping_set_target(PING_TARGET_IP_ADDRESS_COUNT, &ping_count, sizeof(uint32_t));
  esp_ping_set_target(PING_TARGET_RCV_TIMEO, &ping_timeout, sizeof(uint32_t));
  esp_ping_set_target(PING_TARGET_DELAY_TIME, &ping_delay, sizeof(uint32_t));
  esp_ping_set_target(PING_TARGET_IP_ADDRESS, &ip.addr, sizeof(uint32_t));
  esp_ping_set_target(PING_TARGET_RES_FN, &pingResults, sizeof(pingResults));
  seq_no=0;
  #if ESP_IDF_VERSION_MAJOR < 5
  ping_init();
  #endif
}
void jswrap_wifi_setSNTP(JsVar *jsServer, JsVar *jsZone) {
  if (!jsvIsString(jsZone)) {
    jsExceptionHere(JSET_ERROR, "Zone is not a string");
    return;
  }

  if (!jsvIsString(jsServer)) {
    jsExceptionHere(JSET_ERROR, "Server is not a string");
    return;
  }
  char zone[64];
  jsvGetString(jsZone, zone, 64);

  char server[64];
  jsvGetString(jsServer, server, 64);

  setenv("TZ", zone, 1);
  tzset();

#if ESP_IDF_VERSION_MAJOR < 4
  // Do nothing - SNTP stops with WiFi disconnect
#elif ESP_IDF_VERSION_MAJOR >= 4
  if (esp_sntp_enabled()) {
    esp_sntp_stop();
  }
#endif

  sntp_setoperatingmode(SNTP_OPMODE_POLL);
  sntp_setservername(0, server);
  sntp_init();
  jsDebug(DBG_INFO, "SNTP: %s %s\n", server, zone);
}

/**
 * Handle a response from esp_gethostbyname.
 * Invoke the callback function to inform the caller that a hostname has been converted to
 * an IP address.  The callback function should take a parameter that is the IP address.
 */

static void dnsFoundCallback(
    const char *hostname,    //!< The hostname that was converted to an IP address.
    const ip_addr_t *ipAddr, //!< The ip address retrieved.  This may be 0.
    void *arg                //!< Parameter passed in from espconn_gethostbyname.
  ) {

  jsDebug(DBG_INFO, "Wifi.getHostByName CB - %s %x\n", hostname, ipAddr );
  if (g_jsHostByNameCallback != NULL) {
    JsVar *params[1];
    if (ipAddr && IP_IS_V4(ipAddr)) {
      ip4_addr_t *ip4 = ip_2_ip4(ipAddr);
      params[0] = networkGetAddressAsString((uint8_t *)&ip4->addr, 4, 10, '.');
    } else {
      params[0] = jsvNewNull();
    }
    jsiQueueEvents(NULL, g_jsHostByNameCallback, params, 1);
    jsvUnLock(params[0]);
    jsvUnLock(g_jsHostByNameCallback);
    g_jsHostByNameCallback = NULL;
  }
}

void jswrap_wifi_getHostByName(
    JsVar *jsHostname,
    JsVar *jsCallback
) {
  ip_addr_t ipAddr;
  char hostname[256];

  jsDebug(DBG_INFO, "Wifi.getHostByName\n");

  if (!jsvIsString(jsHostname)) {
    jsExceptionHere(JSET_ERROR, "Hostname parameter is not a string");
    return;
  }
  if (!jsvIsFunction(jsCallback)) {
    jsExceptionHere(JSET_ERROR, "Callback is not a function");
    return;
  }
  // Save the callback, unlocking an old one if needed.
  if (g_jsHostByNameCallback != NULL)
    jsvUnLock(g_jsHostByNameCallback);
  g_jsHostByNameCallback = jsCallback;
  jsvLockAgainSafe(g_jsHostByNameCallback);

  jsvGetString(jsHostname, hostname, sizeof(hostname));

#if ESP_IDF_VERSION_MAJOR >= 4
  // IDF 4/5: show current DNS server via ESP‑NETIF
    esp_netif_t *sta = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    esp_netif_dns_info_t dns_info;
    esp_err_t ret = esp_netif_get_dns_info(sta, ESP_NETIF_DNS_MAIN, &dns_info);
    if (ret == ESP_OK) {
      if (dns_info.ip.type == IPADDR_TYPE_V4) {
        uint32_t addr = dns_info.ip.u_addr.ip4.addr;
        jsDebug(DBG_INFO,"DNS server: %d.%d.%d.%d\n",
          (addr>>0)&0xff, (addr>>8)&0xff,
          (addr>>16)&0xff, (addr>>24)&0xff);
      }
    } else {
    jsDebug(DBG_INFO, "esp_netif_get_dns_info: %d\n", ret);
  }
#endif

  jsDebug(DBG_INFO, "Wifi.getHostByName: %s\n", hostname);
  esp_err_t err = dns_gethostbyname(hostname, &ipAddr, dnsFoundCallback, NULL);
  if (err) jsDebug(DBG_INFO,"err = %d (%s)\n", err, esp_err_to_name(err));
  if (err == ESP_OK) {
    jsDebug(DBG_INFO, "Already resolved\n");
    dnsFoundCallback(hostname, &ipAddr, NULL);
  } else if (err == ERR_INPROGRESS) {
    jsDebug(DBG_INFO,"DNS query in progress (ERR_INPROGRESS)\n");
  } else {
    jsDebug(DBG_INFO,"DNS lookup failed: %d from dns_gethostbyname\n", err);
    // no callback will come
    if (g_jsHostByNameCallback != NULL) {
      JsVar *params[1] = { jsvNewNull() };
      jsiQueueEvents(NULL, g_jsHostByNameCallback, params, 1);
      jsvUnLock(params[0]);
      jsvUnLock(g_jsHostByNameCallback);
      g_jsHostByNameCallback = NULL;
    }
  }
}

// worker for jswrap_wifi_setIP and jswrap_wifi_setAPIP
static void setIP(JsVar *jsSettings, JsVar *jsCallback, int interface) {
  char ipTmp[20];
  int len = 0;
  esp_err_t err;
#if ESP_IDF_VERSION_MAJOR>=5
  esp_netif_ip_info_t info;
  memset(&info, 0, sizeof(info));
#else
  tcpip_adapter_ip_info_t info;
  memset( &info, 0, sizeof(info) );
#endif

