espruino/Espruino/libs/network/esp32/jswrap_esp32_network.c
// first check parameter
  if (!jsvIsObject(jsSettings)) {
    EXPECT_OPT_EXCEPTION(jsSettings);
    return;
  }

// get,check and store ip
  JsVar *jsIP = jsvObjectGetChildIfExists(jsSettings, "ip");
  if (jsIP != NULL && !jsvIsString(jsIP)) {
      EXPECT_OPT_EXCEPTION(jsIP);
      jsvUnLock(jsIP);
      return;
  }
  jsvGetString(jsIP, ipTmp, sizeof(ipTmp)-1);
  info.ip.addr = networkParseIPAddress(ipTmp);
  if ( info.ip.addr  == 0) {
    jsExceptionHere(JSET_ERROR, "Not a valid IP address");
    jsvUnLock(jsIP);
    return;
  }
  jsvUnLock(jsIP);

// get, check and store gw
  JsVar *jsGW = jsvObjectGetChildIfExists(jsSettings, "gw");
  if (jsGW != NULL && !jsvIsString(jsGW)) {
      EXPECT_OPT_EXCEPTION(jsGW);
      jsvUnLock(jsGW);
      return ;
  }
  jsvGetString(jsGW, ipTmp, sizeof(ipTmp)-1);
  info.gw.addr = networkParseIPAddress(ipTmp);
  if (info.gw.addr == 0) {
    jsExceptionHere(JSET_ERROR, "Not a valid Gateway address");
    jsvUnLock(jsGW);
    return;
  }
  jsvUnLock(jsGW);

// netmask setting
  JsVar *jsNM = jsvObjectGetChildIfExists(jsSettings, "netmask");
  if (jsNM != NULL && !jsvIsString(jsNM)) {
      EXPECT_OPT_EXCEPTION(jsNM);
      jsvUnLock(jsNM);
      return;
  }
  jsvGetString(jsNM, ipTmp, sizeof(ipTmp)-1);
  info.netmask.addr = networkParseIPAddress(ipTmp);
  if (info.netmask.addr == 0) {
    jsExceptionHere(JSET_ERROR, "Not a valid Netmask");
    jsvUnLock(jsNM);
    return;
  }
  jsvUnLock(jsNM);
// set IP for station
  if (interface == WIFI_IF_STA) {
#if ESP_IDF_VERSION_MAJOR>=5
    esp_netif_t *netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    esp_netif_dhcpc_stop(netif);  // CLIENT DHCP for STA
    err = esp_netif_set_ip_info(netif, &info);
#else
    tcpip_adapter_dhcpc_stop(TCPIP_ADAPTER_IF_STA);
    err = tcpip_adapter_set_ip_info(TCPIP_ADAPTER_IF_STA, &info);
#endif
  }
// set IP for access point
  else {
#if ESP_IDF_VERSION_MAJOR>=5
    esp_netif_t *netif = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");
    if (netif != NULL) {
      esp_netif_dhcps_stop(netif);
      err = esp_netif_set_ip_info(netif, &info);
      esp_netif_dhcps_start(netif);
    }
#else
    tcpip_adapter_dhcps_stop(TCPIP_ADAPTER_IF_AP);
    err = tcpip_adapter_set_ip_info(TCPIP_ADAPTER_IF_AP, &info);
    tcpip_adapter_dhcps_start(TCPIP_ADAPTER_IF_AP);
#endif
  }
// Schedule callback
  if (jsvIsFunction(jsCallback)) {
    JsVar *params[1];
    params[0] = err ? jsvNewFromString("Failure") : jsvNewWithFlags(JSV_NULL);
    jsiQueueEvents(NULL, jsCallback, params, 1);
    jsvUnLock(params[0]);
  }
  else {
    jsExceptionHere(JSET_ERROR, "Callback is not a function");
  }
  return ;
};


void jswrap_wifi_setIP(JsVar *jsSettings, JsVar *jsCallback) {
  setIP(jsSettings, jsCallback, WIFI_IF_STA);
  return ;
}

void jswrap_wifi_setAPIP(JsVar *jsSettings, JsVar *jsCallback) {
  setIP(jsSettings, jsCallback, WIFI_IF_AP);
  return ;
}
